package com.test.java.question.Array;

public class Q09 {
	public static void main(String[] args) {
		/*
		9번 문제 
		요구사항  : 배열의 요소를 순차적으로 2개씩 더한 결과를 배열로 생성한 뒤 출력하시오.
		조건	    : 원본 배열 길이: 사용자 입력
				  원본 배열 요소: 난수(1~9)
				  결과 배열 길이: 사용자 입력 / 2
		입력     : 배열 길이: 10
		출력     : 원본 : [ 1, 5, 3, 6, 2, 7, 8, 2, 2, 9 ]
				  결과 : [ 6, 9, 9, 10, 11 ]
		입력     : 배열 길이: 4
		출력     : 원본 : [ 5, 3, 9, 1 ]
				  결과 : [ 8, 10 ]
		입력     : 배열 길이: 5
		출력     : 원본 : [ 1, 5, 3, 2, 7 ]
				  결과 : [ 6, 5, 7 ]
		 */
	}

}
