package com.test.java.question.String;

public class Q12 {
	public static void main(String[] args) throws Exception {


		/*
		12번 문제 
		요구사항  : 연산식을 입력받아 실제 연산을 하시오.
		조건     : 산술 연산자만 구현하시오.(+, -, *, /, %)
				  연산식의 공백은 자유롭게 입력 가능합니다.
				  산술 연산자가 반드시 존재하는지 체크하시오.
				  피연산자의 갯수가 2개인지 체크하시오.
		입력 		: 입력: 10 + 2 
		출력     : 10 + 2 = 12
		입력 		: 입력: 2 * 7 
		출력     : 2 * 7 = 14
		입력 		: 입력: 10 # 5 
		출력     : 연산자가 올바르지 않습니다.
		입력 		: 입력: 10 + 
		출력     : 피연산자가 부족합니다.
		입력 		: 입력: + 20 
		출력     : 피연산자가 부족합니다.
		 */ }
}
